/* 新增學生資料 */
INSERT INTO `students` 
(`sId`,`sName`,`sGender`,`sNickname`)
VALUES
('003', '王○○', '男', '小王'),
('004', '江○○', '女', '小江'),
('005', '周○○', '女', '小周'),
('006', '黃○○', '男', '小黃'),
('007', '丁○○', '男', '小丁'),
('008', '鄭○○', '男', '小鄭'),
('087', '楊○○', '男', '好人'),
('088', '陳○○', '女', '小白');

/* 新增課程資料 */
INSERT INTO `courses` 
(`cId`, `cName`, `credit`, `isCompulsory`, `tId`) 
VALUES
('C001', '程式設計', 4, 1, 'T001'),
('C002', '網頁設計', 3, 1, 'T002'),
('C003', '視覺設計', 2, 1, 'T003'),
('C004', '網路教學', 4, 1, 'T005');

/* 新增成績資料 */
INSERT INTO `scores` 
(`sId`, `cId`, `score`) 
VALUES
('087', 'C001', 74),
('087', 'C002', 93),
('088', 'C002', 63),
('088', 'C003', 82),
('088', 'C004', 94);


/* 新增老師資料 */
INSERT INTO `teachers` 
(`tId`, `tName`) 
VALUES
('T001', '曾○○'),
('T002', '林○○'),
('T003', '王○○'),
('T005', '謝○○');
